app/Controllers/AdminController.php

    public function addUser()
    {
        $data = $this->request->getPost();

        // Validate input
        if (!$data || empty($data['name']) || empty($data['email']) || empty($data['password'])) {
            return redirect()->back()->with('error', 'All fields are required.');
        }

        if (!filter_var($data['email'], FILTER_VALIDATE_EMAIL)) {
            return redirect()->back()->with('error', 'Invalid email format.');
        }

        // Check for duplicate email
        if ($this->userModel->where('email', $data['email'])->first()) {
---
SELECT *
FROM `users`
WHERE `email` = 'koy@example.com'
 LIMIT 1