app/Controllers/Auth.php

    public function login()
    {
        helper(['form']);

        if ($this->request->getMethod() === 'POST') {
            $session   = session();
            $userModel = new UserModel();

            $rules = [
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[6]'
            ];

            if (!$this->validate($rules)) {
                return view('auth/login', ['validation' => $this->validator]);
            }

            $user = $userModel->where('email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'koy@example.com'
 LIMIT 1

    public function dashboard()
{
    $session = session();

    if (! $session->get('isLoggedIn')) {
        return redirect()->to(base_url('login'))->with('login_error', 'Please log in first.');
    }

    $role = strtolower((string) $session->get('role'));

    $userModel = new UserModel();
    $courseModel = new \App\Models\CourseModel();
    $notificationModel = new \App\Models\NotificationModel();

    $data = [
        'notifications' => $notificationModel->getNotificationsForUser((int)$session->get('userID'))
    ];

    switch ($role) {
        case 'admin':
            $data['usersCount'] = $userModel->countAllResults();
            $data['recentUsers'] = $userModel->orderBy('id', 'DESC')->limit(5)->find();
            $data['courses'] = $courseModel->findAll();
            break;

        case 'teacher':
            $teacherId = (int) $session->get('userID');
            $enrollmentModel = new EnrollmentModel();
            $data['courses'] = $courseModel->where('teacher_id', $teacherId)->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 5
SELECT *
FROM `courses`
SELECT *
FROM `courses`
WHERE `teacher_id` = 2

            $userId = (int) $session->get('userID');

            // Profile
            $data['profile'] = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 3

            $data['materials'] = [];

            foreach ($data['courses'] as $course) {
                $courseMaterials = $materialModel->where('course_id', $course['course_id'])->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` = '4'