app/Controllers/Course.php

    public function enroll(): ResponseInterface
    {
        $session = session();
        if (! $session->get('isLoggedIn')) {
            return $this->response->setStatusCode(401)
                ->setJSON(['success' => false, 'message' => 'Please log in first.']);
        }

        $userId = (int) $session->get('userID');
        $courseId = (int) ($this->request->getPost('course_id') ?? 0);

        if ($courseId <= 0) {
            return $this->response->setStatusCode(400)
                ->setJSON(['success' => false, 'message' => 'Invalid course_id.']);
        }

        $enrollmentModel = new EnrollmentModel();

        $existing = $enrollmentModel->where(['user_id' => $userId, 'course_id' => $courseId])->first();
        if ($existing) {
            return $this->response->setJSON(['success' => true, 'alreadyEnrolled' => true, 'message' => 'Already enrolled.']);
        }

        $insertData = [
            'user_id' => $userId,
            'course_id' => $courseId,
            'enrollment_date' => date('Y-m-d H:i:s'),
        ];

        $inserted = $enrollmentModel->insert($insertData, true);
---
SELECT *
FROM `enrollments`
WHERE `user_id` = 3
AND `course_id` = 4
 LIMIT 1
INSERT INTO `enrollments` (`user_id`, `course_id`, `enrollment_date`) VALUES (3, 4, '2025-10-20 14:40:53')