app/Controllers/Course.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = 1
UPDATE `courses` SET `title` = 'Introduction to Web Development', `description` = 'Learn the fundamentals of HTML, CSS, and JavaScript for building modern websites.', `school_year` = '2024-2025', `class_time` = 'MWF 9:00-10:00 AM', `updated_at` = '2025-12-05 13:42:19'
WHERE `courses`.`id` IN (1)
---
    public function updateCourse(int $courseId)
    {
        $session = session();
        if (! $session->get('isLoggedIn') || strtolower($session->get('role')) !== 'teacher') {
            return redirect()->to(base_url('dashboard'))->with('error', 'Access denied.');
        }

        $teacherId = (int) $session->get('userID');
        $course = $this->courseModel->find($courseId);

        if (! $course || (int) ($course['teacher_id'] ?? 0) !== $teacherId) {
            return redirect()->back()->with('error', 'Course not found or not assigned to you.');
        }

        $data = [
            'title' => trim((string) $this->request->getPost('title')),
            'description' => trim((string) $this->request->getPost('description')),
            'school_year' => trim((string) $this->request->getPost('school_year')),
            'class_time' => trim((string) $this->request->getPost('class_time')),
        ];

        $this->courseModel->update($courseId, $data);