app/Models/EnrollmentModel.php

    public function getUserEnrollments(int $userId, ?string $status = 'accepted'): array
    {
        $builder = $this->select('enrollments.*, courses.title, courses.description, courses.school_year, courses.class_time, courses.teacher_id, users.name AS student_name, users.email AS student_email')
            ->join('courses', 'courses.id = enrollments.course_id', 'left')
            ->join('users', 'users.id = enrollments.user_id', 'left')
            ->where('enrollments.user_id', $userId);

        if ($status !== null) {
            $builder->where('enrollments.status', $status);
        }

        return $builder->orderBy('enrollments.enrollment_date', 'DESC')->findAll();
---
SELECT `enrollments`.*, `courses`.`title`, `courses`.`description`
FROM `enrollments`
LEFT JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = 3
ORDER BY `enrollments`.`enrollment_date` DESC

    public function getEnrollmentsForTeacher(int $teacherId, ?string $status = null): array
    {
        $builder = $this->select('enrollments.*, users.name AS student_name, users.email AS student_email, courses.title AS course_title, courses.school_year, courses.class_time, courses.teacher_id')
            ->join('courses', 'courses.id = enrollments.course_id', 'left')
            ->join('users', 'users.id = enrollments.user_id', 'left')
            ->where('courses.teacher_id', $teacherId);

        if ($status !== null) {
            $builder->where('enrollments.status', $status);
        }

        return $builder->orderBy('enrollments.enrollment_date', 'DESC')->findAll();
---
SELECT `enrollments`.*, `users`.`name` AS `student_name`, `users`.`email` AS `student_email`, `courses`.`title` AS `course_title`, `courses`.`school_year`, `courses`.`class_time`, `courses`.`teacher_id`
FROM `enrollments`
LEFT JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `courses`.`teacher_id` = 2
AND `enrollments`.`status` = 'pending'
ORDER BY `enrollments`.`enrollment_date` DESC