app/Models/NotificationModel.php

SELECT *
FROM `notifications`
WHERE `user_id` = 3
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getNotificationsForUser($userId, $limit = 5)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();